Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.GetWindowType
Gets the analytic window type this surface is associated with. Null when this surface is not a window.
Returns:
The analytic window type.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.GetConstruction
Gets the analytic construction this surface is associated with. Null when this surface is a window.
Returns:
The analytic construction.
Since:
2024